In [19]:
import pandas as pd

In [20]:
data={'이름':['메로나','비비빅','죠스바'],
      '가격':[300,400,250],
      '재고':[20,3,100]}
DF=pd.DataFrame(data)
DF

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [21]:
print(DF.index,DF.columns,DF.values,DF.shape,
      DF.ndim,DF.dtypes)

RangeIndex(start=0, stop=3, step=1) Index(['이름', '가격', '재고'], dtype='object') [['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]] (3, 3) 2 이름    object
가격     int64
재고     int64
dtype: object

In [22]:
DF['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [23]:
DF[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [24]:
DF.loc[0][['가격','재고']]

가격    300
재고     20
Name: 0, dtype: object

In [25]:
DF.index='일','이','삼'
DF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [26]:
DF['총가격']=0
DF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [27]:
DF.loc['사']='빵빠레','550원','10개',0
DF

    이름    가격   재고  총가격
일  메로나   300   20    0
이  비비빅   400    3    0
삼  죠스바   250  100    0
사  빵빠레  550원  10개    0

In [28]:
DF.loc['이','재고']=23
DF

    이름    가격   재고  총가격
일  메로나   300   20    0
이  비비빅   400   23    0
삼  죠스바   250  100    0
사  빵빠레  550원  10개    0

In [30]:
DF=pd.DataFrame([[2000,3050,2050,1980],[7500,2050,2050,1980],
      [15450,15050,15550,14900]],columns=['시가','고가','저가','종가'])
DF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900